; Преведете следващите изрази в префиксна форма
; Попълвате на мястото на (void)

; a - ((2 + 3/16) / (9 * 2.78)) + ((5 / 2) - 6)
(define a (+ (/ (+ 2 (/ 3 16)) (* 9 2.78)) (- (/ 5 2) 6)))

; b - (15 + 21 + (3 / 15) + (7 - (2 * 2))) / 16
(define b (/ (+ 15 21 (/ 3 15) (- 7 (* 2 2))) 16))

; c - (5 + 1/4 + (2 - (3 - (6 + 1/5)))) / 3(6 - 2)(2 - 7)
(define c (/ (+ 5 (/ 1 4) (- 2 (- 3 (+ 6 (/ 1 5))))) (* 3 (- 6 2) (- 2 7))))

(define (square x) (* x x))
(define (cube x) (* x x x))

; d - (3^2 + 5) / (3^3 - 2)
(define d (/ (+ (square 3) 5) (- (cube 3) 2)))

; e - (16^4 + 95/2)
(define e (+ (square (square 16)) (/ 95 2)))

